Revit 2027 API
BoundingBoxXYZ.MaxEnabled Property
Defines whether the maximum bound is active for given dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool this[
	int dim
] { get; set; }
Public Property MaxEnabled (
	dim As Integer
) As Boolean
	Get
	Set
public:
property bool MaxEnabled[int dim] {
	bool get (int dim);
	void set (int dim, bool value);
}
member MaxEnabled : bool with get, set
Parameters
dim Int32
Property Value
Boolean
Remarks
Use 0 for X, 1 for Y and 2 for Z. The entire box must be enabled to have enabled individual bounds.
See Also
Reference
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace